In [1]:
import numpy as np
import pandas as pd

path = 'https://github.com/Rogerio-mack/IMT_Ciencia_de_Dados/raw/main/data/'

CASE: Gapminder

Os dados dos exercícios a seguir tem como fonte o site Gapmider.

Q0. Inspecione os dados.
Inspecione as bases de dados antes de prosseguir. Acesse e faça ao menos um head() de cada conjunto de dados.

In [133]:
paises = pd.read_csv('https://github.com/open-numbers/ddf--gapminder--co2_emission/raw/master/ddf--entities--country.csv')
paises.head()

  country         name
0    abkh     Abkhazia
1     abw        Aruba
2     afg  Afghanistan
3     ago       Angola
4     aia     Anguilla

In [132]:
emi = pd.read_csv('https://github.com/open-numbers/ddf--gapminder--co2_emission/raw/master/ddf--datapoints--yearly_co2_emissions_1000_tonnes--by--country--year.csv')
emi

      country  year  yearly_co2_emissions_1000_tonnes
0         abw  1959                         719.95990
1         abw  1960                         619.06728
2         abw  1961                         646.08113
3         abw  1962                         709.52273
4         abw  1963                         679.64378
...       ...   ...                               ...
20378     zwe  2014                       11971.40630
20379     zwe  2015                       12173.09130
20380     zwe  2016                       10816.28203
20381     zwe  2017                       12035.72697
20382     zwe  2018                       12272.73824

[20383 rows x 3 columns]

In [4]:
eletricidade = pd.read_csv('https://github.com/open-numbers/ddf--bp--energy/raw/master/ddf--datapoints--coal_electricity_generation_twh--by--geo--year.csv')
eletricidade.head()

         geo  year  coal_electricity_generation_twh
0  argentina  1985                            0.607
1  argentina  1986                            1.013
2  argentina  1987                            1.016
3  argentina  1988                            1.586
4  argentina  1989                            0.865

Q1. merge()
Crie um DataFrame df das emissões de CO2 incluindo o nome do país.

(Moodle) Verifique da lista abaixo quais países não tem dados para o ano mais recente da base.
Dica:

Crie um DataFrame df_lista com a lista de países
Crie um DataFrame df_temp fazendo um left join com df_lista
Separe como df_temp[df_temp.isna().any(axis=1)] os valores nulos incluídos de df_lista no left join

In [113]:
lista = ['USSR', 'Hong Kong, China', 'Honduras', 'Antarctica', 'Croatia', 'Haiti', 'Hungary',
         'Indonesia', 'India', 'Ireland', 'Iran', 'Iraq', 'Iceland',
         'Israel', 'Italy', 'Jamaica', 'Jordan', 'Japan', 'Kazakhstan', 'Monaco']

temp = paises[paises.name.isin(lista)]
temp = temp.merge(emi,how='left')
linhas_com_nulos = temp[temp.isnull().any(axis=1)]
linhas_com_nulos

     country        name  year  yearly_co2_emissions_1000_tonnes
0        ata  Antarctica   NaN                               NaN
1846     mco      Monaco   NaN                               NaN

----------------------------------------------------------------------------------------------------------

Q2. merge() 2
Exclua os países identificados na questão anterior da lista. Empregue o DataFrame df para identificar os 3 países que mais efetuaram emissões no ano mais recente da base. Quais são esses países?

In [141]:
lista = ['Hong Kong, China', 'Honduras', 'Croatia', 'Haiti', 'Hungary',
         'Indonesia', 'India', 'Ireland', 'Iran', 'Iraq', 'Iceland',
         'Israel', 'Italy', 'Jamaica', 'Jordan', 'Japan', 'Kazakhstan']
temp = paises[paises.name.isin(lista)]
temp = temp.merge(emi,how='left')
temp.head()

  country              name  year  yearly_co2_emissions_1000_tonnes
0     hkg  Hong Kong, China  1938                            55.005
1     hkg  Hong Kong, China  1939                            55.005
2     hkg  Hong Kong, China  1941                            55.005
3     hkg  Hong Kong, China  1947                            18.335
4     hkg  Hong Kong, China  1948                            25.669

In [123]:
Q2 = temp[temp.year == 2018]
Q2.nlargest(3,columns='yearly_co2_emissions_1000_tonnes')

     country   name  year  yearly_co2_emissions_1000_tonnes
741      ind  India  2018                      2.656274e+06
1677     jpn  Japan  2018                      1.162933e+06
965      irn   Iran  2018                      7.210043e+05

----------------------------------------------------------------------------------------------------------

Q3. join()
Procure obter o mesmo resultado DataFrame anterior que você construiu com o método merge(), empregando agora o método join().

Dica: Empregue set_index().

In [135]:
emi.join(paises.set_index('country'), on='country')

      country  year  yearly_co2_emissions_1000_tonnes      name
0         abw  1959                         719.95990     Aruba
1         abw  1960                         619.06728     Aruba
2         abw  1961                         646.08113     Aruba
3         abw  1962                         709.52273     Aruba
4         abw  1963                         679.64378     Aruba
...       ...   ...                               ...       ...
20378     zwe  2014                       11971.40630  Zimbabwe
20379     zwe  2015                       12173.09130  Zimbabwe
20380     zwe  2016                       10816.28203  Zimbabwe
20381     zwe  2017                       12035.72697  Zimbabwe
20382     zwe  2018                       12272.73824  Zimbabwe

[20383 rows x 4 columns]

----------------------------------------------------------------------------------------------------------

Q4. merge(how='inner') & apply()
Crie um DataFrame de energia produzida a partir do carvão incluindo o nome do país. Empregue um inner join.

Dica: veja por que o merge direto não funciona.

(Moodle) Quantos países há na base produzida e a soma de todos os valores coal_electricity_generation_twh?

In [185]:
eletricidade2 = eletricidade.rename(columns={'geo':'name'})

In [194]:
eletricidade2['name'] = eletricidade2['name'].apply(lambda x:x.title())
eletricidade2.head()

        name  year  coal_electricity_generation_twh
0  Argentina  1985                            0.607
1  Argentina  1986                            1.013
2  Argentina  1987                            1.016
3  Argentina  1988                            1.586
4  Argentina  1989                            0.865

In [195]:
paises.head()

  country         name
0    abkh     Abkhazia
1     abw        Aruba
2     afg  Afghanistan
3     ago       Angola
4     aia     Anguilla

In [198]:
Q4 = pd.merge(paises,eletricidade2,on='name',how='inner')

In [199]:
Q4

    country       name  year  coal_electricity_generation_twh
0       arg  Argentina  1985                         0.607000
1       arg  Argentina  1986                         1.013000
2       arg  Argentina  1987                         1.016000
3       arg  Argentina  1988                         1.586000
4       arg  Argentina  1989                         0.865000
..      ...        ...   ...                              ...
800     vnm    Vietnam  2015                        52.711370
801     vnm    Vietnam  2016                        63.931889
802     vnm    Vietnam  2017                        62.538700
803     vnm    Vietnam  2018                        83.900960
804     vnm    Vietnam  2019                       112.527968

[805 rows x 4 columns]

In [200]:
Q4.coal_electricity_generation_twh.sum()

137198.26802701

In [208]:
Q4.country.describe()

count     805
unique     23
top       arg
freq       35
Name: country, dtype: object

----------------------------------------------------------------------------------------------------------

Q5. merge(how='right') & apply()
Recrie o DataFrame anterior agora empregando right (left) join para incluir países que não foram encontrados em country_entities.

(Moodle) Quais dos países ou geo posições apresentam name null no DataFrame produzido?

Dica: empregue isnull()

In [278]:
Q5 = pd.merge(paises,eletricidade2,on='name',how='right')

In [303]:
Q5['name'] = Q5['name'].apply(lambda x:x.lower())

In [304]:
nulos = Q5[Q5.country.isnull()]

In [305]:
nulos

     country          name  year  coal_electricity_generation_twh
560      NaN  other_africa  1985                         4.111336
561      NaN  other_africa  1986                         6.090250
562      NaN  other_africa  1987                         9.454476
563      NaN  other_africa  1988                         9.416726
564      NaN  other_africa  1989                         8.748628
...      ...           ...   ...                              ...
1500     NaN            us  2015                      1468.295586
1501     NaN            us  2016                      1346.189340
1502     NaN            us  2017                      1310.004561
1503     NaN            us  2018                      1246.693485
1504     NaN            us  2019                      1053.529530

[735 rows x 4 columns]

In [326]:
lista1 =['us', 'jamaica', 'brazil']
lista2=['brazil', 'russian_federation', 'south_korea']
lista3=['total_europe', 'us', 'jamaica']
lista4=['russian_federation', 'saudi_arabia', 'south_korea']
lista5=['south_africa', 'south_korea', 'europe']
nulos = list(nulos.name.unique())

In [327]:
all(item in nulos for item in lista1)

False

In [328]:
all(item in nulos for item in lista2)

False

In [329]:
all(item in nulos for item in lista3)

False

In [330]:
all(item in nulos for item in lista4)

True

In [331]:
all(item in nulos for item in lista5)

False